zup/ЗУП_бюджет/src/DataProcessors/ИндексацияОкладовГосударственнойСлужбы/ИндексацияОкладовГосударственнойСлужбы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИндексацияОкладовГосударственнойСлужбы</name>
</mdclass:DataProcessor>

zup/ЗУП_бюджет/src/InformationRegisters/ОкладыПоВоинскимСпециальнымЗваниям/ОкладыПоВоинскимСпециальнымЗваниям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОкладыПоВоинскимСпециальнымЗваниям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВоинскоеСпециальноеЗвание</name>
    <type>
      <types>CatalogRef.ВоинскиеСпециальныеЗвания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/ОкладыНадбавкиПоКласснымЧинамРангам/ОкладыНадбавкиПоКласснымЧинамРангам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОкладыНадбавкиПоКласснымЧинамРангам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КлассныйЧинРанг</name>
    <type>
      <types>CatalogRef.КлассныеЧиныРанги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/Enums/ВидыИндексируемогоДенежногоСодержания/ВидыИндексируемогоДенежногоСодержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИндексируемогоДенежногоСодержания</name>
  <enumValues>
    <name>ОкладыДенежногоСодержания</name>
  </enumValues>
  <enumValues>
    <name>ОкладыПоДолжности</name>
  </enumValues>
  <enumValues>
    <name>ОкладыПоЗванию</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Documents/ИндексацияШтатногоРасписания/ИндексацияШтатногоРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИндексацияШтатногоРасписания</name>
  <registerRecords>InformationRegister.УдалитьИсторияИспользованияДолжностей</registerRecords>
  <registerRecords>InformationRegister.ИсторияПоказателейПоШтатномуРасписанию</registerRecords>
  <registerRecords>InformationRegister.ИсторияНачисленийПоШтатномуРасписанию</registerRecords>
  <registerRecords>InformationRegister.ИсторияИспользованияШтатногоРасписания</registerRecords>
  <registerRecords>InformationRegister.УдалитьИсторияИспользованияПодразделений</registerRecords>
  <attributes>
    <name>МесяцИндексации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентИндексации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИндексацииГосударственныхСлужащих</name>
    <type>
      <types>EnumRef.ВидыИндексируемогоДенежногоСодержания</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексацияВоеннослужащих</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИндексируемыеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОкругления</name>
      <type>
        <types>CatalogRef.СпособыОкругленияПриРасчетеЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Позиции</name>
    <attributes>
      <name>ПозицияШтатногоРасписания</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладТариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладТарифМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладТарифМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФОТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФОТМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФОТМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РайонныйКоэффициентРазмер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РайонныйКоэффициентРазмерМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РайонныйКоэффициентРазмерМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СевернаяНадбавкаРазмер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СевернаяНадбавкаРазмерМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СевернаяНадбавкаРазмерМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьТарифнаяСетка</name>
      <type>
        <types>CatalogRef.ТарифныеСетки</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьТарифнаяСеткаНадбавки</name>
      <type>
        <types>CatalogRef.ТарифныеСетки</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьРазрядКатегорияНадбавки</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>НадбавкаЗаВредностьРазмер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НадбавкаЗаВредностьРазмерМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НадбавкаЗаВредностьРазмерМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ИдентификаторСтрокиПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ИдентификаторСтрокиПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМин</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМакс</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/Documents/УтверждениеОкладовЗаВоинскиеСпециальныеЗвания/УтверждениеОкладовЗаВоинскиеСпециальныеЗвания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УтверждениеОкладовЗаВоинскиеСпециальныеЗвания</name>
  <registerRecords>InformationRegister.ОкладыПоВоинскимСпециальнымЗваниям</registerRecords>
  <attributes>
    <name>ДатаВступленияВСилу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оклады</name>
    <attributes>
      <name>ВоинскоеСпециальноеЗвание</name>
      <type>
        <types>CatalogRef.ВоинскиеСпециальныеЗвания</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/Documents/УтверждениеОкладовНадбавокЗаКлассныеЧины/УтверждениеОкладовНадбавокЗаКлассныеЧины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УтверждениеОкладовНадбавокЗаКлассныеЧины</name>
  <registerRecords>InformationRegister.ОкладыНадбавкиПоКласснымЧинамРангам</registerRecords>
  <attributes>
    <name>ДатаВступленияВСилу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОкладыНадбавки</name>
    <attributes>
      <name>КлассныйЧинРанг</name>
      <type>
        <types>CatalogRef.КлассныеЧиныРанги</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/DataProcessors/ИндексацияОкладовГосударственнойСлужбы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции	

Функция СоздатьДокументыИндексации(ПараметрыИндексации) Экспорт
	ДокументыИндексаторы = Новый Массив();
	
	ПерезаписываемыеРегистраторы = ПараметрыИндексации.Регистраторы;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИндексациюШтатногоРасписания") Тогда
	
		ИндексаторШР = СоздатьДокументИндексацииШР(ПараметрыИндексации, ПерезаписываемыеРегистраторы["ИндексацияШтатногоРасписания"]);
		ДокументыИндексаторы.Добавить(ИндексаторШР);
		
	КонецЕсли;
	
	ИндексаторЗаработка = СоздатьДокументИндексацииЗаработка(ПараметрыИндексации, ПерезаписываемыеРегистраторы["ИндексацияЗаработка"]);
	ДокументыИндексаторы.Добавить(ИндексаторЗаработка);
	
	ИзменятьОкладыЗванийЧинов = (ПараметрыИндексации.ВидИндексацииГосударственныхСлужащих = Перечисления.ВидыИндексируемогоДенежногоСодержания.ОкладыДенежногоСодержания
	ИЛИ ПараметрыИндексации.ВидИндексацииГосударственныхСлужащих = Перечисления.ВидыИндексируемогоДенежногоСодержания.ОкладыПоЗванию);
	
	Если ИзменятьОкладыЗванийЧинов Тогда
		Если ПараметрыИндексации.ИндексацияВоеннослужащих Тогда 
			ИндексаторЗванияЧина = СоздатьДокументУтверждениеОкладовЗаВоинскиеСпециальныеЗвания(ПараметрыИндексации, ПерезаписываемыеРегистраторы["УтверждениеОкладовЗаВоинскиеСпециальныеЗвания"]);	
		Иначе
			ИндексаторЗванияЧина = СоздатьДокументУтверждениеОкладовНадбавокЗаКлассныеЧины(ПараметрыИндексации, ПерезаписываемыеРегистраторы["УтверждениеОкладовНадбавокЗаКлассныеЧины"]);	
		КонецЕсли;
		
		Если ИндексаторЗванияЧина <> Неопределено Тогда
			ДокументыИндексаторы.Добавить(ИндексаторЗванияЧина);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокументыИндексаторы;
	
КонецФункции

Функция СтруктураПараметровИндексации() Экспорт
	
	ПараметрыСозданияДокументовИндексации = Новый Структура;
	ПараметрыСозданияДокументовИндексации.Вставить("КоэффициентИндексации");
	ПараметрыСозданияДокументовИндексации.Вставить("Дата");
	ПараметрыСозданияДокументовИндексации.Вставить("ДатаИндексации");
	ПараметрыСозданияДокументовИндексации.Вставить("ДатаВступленияВСилу");
	ПараметрыСозданияДокументовИндексации.Вставить("МесяцИндексации");
	ПараметрыСозданияДокументовИндексации.Вставить("Организация");
	ПараметрыСозданияДокументовИндексации.Вставить("ВидИндексацииГосударственныхСлужащих");
	ПараметрыСозданияДокументовИндексации.Вставить("ИндексацияВоеннослужащих");
	ПараметрыСозданияДокументовИндексации.Вставить("Регистраторы");
	
	Возврат ПараметрыСозданияДокументовИндексации;
	
КонецФункции

Функция	СоздатьДокументИндексацииШР(ПараметрыИндексации, Регистратор = Неопределено)
	
	Если Регистратор = Неопределено Тогда
		ДокументИндексации = Документы.ИндексацияШтатногоРасписания.СоздатьДокумент();
	Иначе
		ДокументИндексации = Регистратор.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокументИндексации,ПараметрыИндексации);
	
	ГосударственнаяСлужба.ЗаполнитьИндексируемыеПоУмолчаниюПоказатели(ДокументИндексации.ИндексируемыеПоказатели, ДокументИндексации.ВидИндексацииГосударственныхСлужащих, ДокументИндексации.ИндексацияВоеннослужащих, Ложь);
	
	ДокументИндексации.ЗаполнитьДокумент();
	ДокументИндексации.Записать(РежимЗаписиДокумента.Запись);	
	
	Возврат ДокументИндексации.Ссылка;
	
КонецФункции

Функция	СоздатьДокументИндексацииЗаработка(ПараметрыИндексации, Регистратор = Неопределено)
	
	Если Регистратор = Неопределено Тогда
		ДокументИндексации = Документы.ИндексацияЗаработка.СоздатьДокумент();
	Иначе
		ДокументИндексации = Регистратор.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокументИндексации,ПараметрыИндексации);
	
	ГосударственнаяСлужба.ЗаполнитьИндексируемыеПоУмолчаниюПоказатели(ДокументИндексации.Показатели, ДокументИндексации.ВидИндексацииГосударственныхСлужащих, ДокументИндексации.ИндексацияВоеннослужащих);
	
	ДокументИндексации.ЗаполнитьДокумент(ДокументИндексации.МесяцИндексации);
	ДокументИндексации.Записать(РежимЗаписиДокумента.Запись);	
	
	Возврат ДокументИндексации.Ссылка;
	
КонецФункции

Функция СоздатьДокументУтверждениеОкладовЗаВоинскиеСпециальныеЗвания(ПараметрыИндексации, Регистратор = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КоэффициентИндексации",	ПараметрыИндексации.КоэффициентИндексации);
	Запрос.УстановитьПараметр("РегистраторНеЗадан",		Регистратор = Неопределено);
	Запрос.УстановитьПараметр("Регистратор",			Регистратор);
	Запрос.УстановитьПараметр("ДатаИндексации",			ПараметрыИндексации.ДатаИндексации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОкладыПоВоинскимСпециальнымЗваниямСрезПоследних.ВоинскоеСпециальноеЗвание КАК ВоинскоеСпециальноеЗвание,
	               |	ОкладыПоВоинскимСпециальнымЗваниямСрезПоследних.Размер * &КоэффициентИндексации КАК Размер
	               |ИЗ
	               |	РегистрСведений.ОкладыПоВоинскимСпециальнымЗваниям.СрезПоследних(
	               |			&ДатаИндексации,
	               |			&РегистраторНеЗадан
	               |				ИЛИ Регистратор <> &Регистратор) КАК ОкладыПоВоинскимСпециальнымЗваниямСрезПоследних";
				   
	НовыеОклады = Запрос.Выполнить().Выгрузить();
	Если НовыеОклады.Количество()> 0 Тогда
		
		Если Регистратор = Неопределено Тогда
			ДокументИндексации = Документы.УтверждениеОкладовЗаВоинскиеСпециальныеЗвания.СоздатьДокумент();
		Иначе
			ДокументИндексации = Регистратор.ПолучитьОбъект();
		КонецЕсли;
		
		
		ЗаполнитьЗначенияСвойств(ДокументИндексации,ПараметрыИндексации);
		
		ДокументИндексации.Оклады.Загрузить(НовыеОклады);
		
		ДокументИндексации.Записать(РежимЗаписиДокумента.Запись);	
		
		Возврат ДокументИндексации.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


Функция СоздатьДокументУтверждениеОкладовНадбавокЗаКлассныеЧины(ПараметрыИндексации, Регистратор = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КоэффициентИндексации",	ПараметрыИндексации.КоэффициентИндексации);
	Запрос.УстановитьПараметр("РегистраторНеЗадан",		Регистратор = Неопределено);
	Запрос.УстановитьПараметр("Регистратор",			Регистратор);
	Запрос.УстановитьПараметр("ДатаИндексации",			ПараметрыИндексации.ДатаИндексации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОкладыНадбавкиПоКласснымЧинамРангамСрезПоследних.КлассныйЧинРанг КАК КлассныйЧинРанг,
	               |	ОкладыНадбавкиПоКласснымЧинамРангамСрезПоследних.Размер * &КоэффициентИндексации КАК Размер
	               |ИЗ
	               |	РегистрСведений.ОкладыНадбавкиПоКласснымЧинамРангам.СрезПоследних(
	               |			&ДатаИндексации,
	               |			&РегистраторНеЗадан
	               |				ИЛИ Регистратор <> &Регистратор) КАК ОкладыНадбавкиПоКласснымЧинамРангамСрезПоследних";
				   
	НовыеОклады = Запрос.Выполнить().Выгрузить();
	Если НовыеОклады.Количество()> 0 Тогда
		
		Если Регистратор = Неопределено Тогда
			ДокументИндексации = Документы.УтверждениеОкладовНадбавокЗаКлассныеЧины.СоздатьДокумент();
		Иначе
			ДокументИндексации = Регистратор.ПолучитьОбъект();
		КонецЕсли;
		
		
		ЗаполнитьЗначенияСвойств(ДокументИндексации,ПараметрыИндексации);
		
		ДокументИндексации.ОкладыНадбавки.Загрузить(НовыеОклады);
		
		ДокументИндексации.Записать(РежимЗаписиДокумента.Запись);	
		
		Возврат ДокументИндексации.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
